limits.html
<head>
<link rel="stylesheet" href="https://sandyuraz.com/styles/org.min.css">
</head>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6e341fe">1. A Problem</a></li>
<li><a href="#org912ce22">2. Some Notation</a></li>
<li><a href="#org4265d65">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6e341fe" class="outline-2">
<h2 id="org6e341fe"><span class="section-number-2">1</span> A Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
Normal or "easy" limits are rather simple, as examples like \(\lim_{x\rightarrow4} \frac{x+3}{x^2 + 1}\) just need some plugging in.
</p>

<p>
Derivatives are usually harder as \(\lim_{x\rightarrow0} \frac{f(x_0+\Delta x) - f(x_0)}{x-x_0}\) always evaluates to \(\frac{0}{0}\), and needs some cancellation.
</p>
</div>
</div>
<div id="outline-container-org912ce22" class="outline-2">
<h2 id="org912ce22"><span class="section-number-2">2</span> Some Notation</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>DEFINITION</b> Right hand limit or \(lim_{x\rightarrow x_0^+} f(x)\) indicates that \(x\) is greater than \(x_0\) (or that \(x\) begins on the right side of the number line).
</p>

<p>
<b>DEFINITION</b> Left hand limit or \(lim_{x\rightarrow x_0^-} f(x)\) indicates that \(x\) is less than \(x_0\) (or that \(x\) begins on the left side of the number line).
These notations will make dealing with limits of these functions more convienient.
</p>

<p>
<b>EXAMPLE</b>
Take the following example of a conditional function:
</p>

<p>
if \(x > 0\), \(f(x) = x+1\)
</p>

<p>
if \(x < 0\), \(f(x) = -x+2\)
</p>


<p>
\(lim_{x\rightarrow x_0^+} f(x) = lim_{x\rightarrow x_0} x+1 = 1\)
</p>

<p>
e\(lim_{x\rightarrow x_0^-} f(x) = lim_{x\rightarrow x_0} -x+2 = 2\)
</p>

<p>
We did not need a \(x=0\) value to compute these limits!
</p>
</div>
</div>


<div id="outline-container-org4265d65" class="outline-2">
<h2 id="org4265d65"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<p>
Adjacent to this: <a href="continuity.html">Continuity</a>
</p>

<p>
Building upon this: <a href="calculating-derivatives.html">Calculating Derivatives</a>
</p>

<p>
Further reference can be found at <a href="limits-continuity-problems.html">Limits and Continuity Practice</a>.
</p>
</div>
</div>
